{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "apple_black_rot",
    "1": "apple_cedar_apple_rust",
    "2": "apple_healthy",
    "3": "apple_scab",
    "4": "blueberry_healthy",
    "5": "cherry_(including_sour)_healthy",
    "6": "cherry_(including_sour)_powdery_mildew",
    "7": "grape_black_rot",
    "8": "grape_esca_(black_measles)",
    "9": "grape_healthy",
    "10": "grape_leaf_blight_(isariopsis_leaf_spot)",
    "11": "maize_(maize)_cercospora_leaf_spot_gray_leaf_spot",
    "12": "maize_(maize)_common_rust_",
    "13": "maize_(maize)_healthy",
    "14": "maize_(maize)_northern_leaf_blight",
    "15": "orange_haunglongbing_(citrus_greening)",
    "16": "peach_bacterial_spot",
    "17": "peach_healthy",
    "18": "pepper,_bell_bacterial_spot",
    "19": "pepper,_bell_healthy",
    "20": "pepper_bell",
    "21": "potato__early_blight",
    "22": "potato__healthy",
    "23": "potato__late_blight",
    "24": "potato_early_blight",
    "25": "potato_healthy",
    "26": "potato_late_blight",
    "27": "ragi_blast",
    "28": "ragi_healthy",
    "29": "ragi_rust",
    "30": "raspberry_healthy",
    "31": "rice_leaf_aug",
    "32": "soybean_healthy",
    "33": "squash_powdery_mildew",
    "34": "strawberry_healthy",
    "35": "strawberry_leaf_scorch",
    "36": "sugarcane_healthy",
    "37": "sugarcane_mosaic",
    "38": "sugarcane_redrot",
    "39": "sugarcane_rust",
    "40": "sugarcane_yellow",
    "41": "tomato_bacterial_spot",
    "42": "tomato_early_blight",
    "43": "tomato_healthy",
    "44": "tomato_late_blight",
    "45": "tomato_leaf_mold",
    "46": "tomato_mosaic_virus",
    "47": "tomato_septoria_leaf_spot",
    "48": "tomato_spider_mites_two_spotted_spider_mite",
    "49": "tomato_target_spot",
    "50": "tomato_yellow_leaf_curl_virus",
    "51": "tomato_yellowleaf",
    "52": "wheat_healthy",
    "53": "wheat_yellow_rust"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "apple_black_rot": 0,
    "apple_cedar_apple_rust": 1,
    "apple_healthy": 2,
    "apple_scab": 3,
    "blueberry_healthy": 4,
    "cherry_(including_sour)_healthy": 5,
    "cherry_(including_sour)_powdery_mildew": 6,
    "grape_black_rot": 7,
    "grape_esca_(black_measles)": 8,
    "grape_healthy": 9,
    "grape_leaf_blight_(isariopsis_leaf_spot)": 10,
    "maize_(maize)_cercospora_leaf_spot_gray_leaf_spot": 11,
    "maize_(maize)_common_rust_": 12,
    "maize_(maize)_healthy": 13,
    "maize_(maize)_northern_leaf_blight": 14,
    "orange_haunglongbing_(citrus_greening)": 15,
    "peach_bacterial_spot": 16,
    "peach_healthy": 17,
    "pepper,_bell_bacterial_spot": 18,
    "pepper,_bell_healthy": 19,
    "pepper_bell": 20,
    "potato__early_blight": 21,
    "potato__healthy": 22,
    "potato__late_blight": 23,
    "potato_early_blight": 24,
    "potato_healthy": 25,
    "potato_late_blight": 26,
    "ragi_blast": 27,
    "ragi_healthy": 28,
    "ragi_rust": 29,
    "raspberry_healthy": 30,
    "rice_leaf_aug": 31,
    "soybean_healthy": 32,
    "squash_powdery_mildew": 33,
    "strawberry_healthy": 34,
    "strawberry_leaf_scorch": 35,
    "sugarcane_healthy": 36,
    "sugarcane_mosaic": 37,
    "sugarcane_redrot": 38,
    "sugarcane_rust": 39,
    "sugarcane_yellow": 40,
    "tomato_bacterial_spot": 41,
    "tomato_early_blight": 42,
    "tomato_healthy": 43,
    "tomato_late_blight": 44,
    "tomato_leaf_mold": 45,
    "tomato_mosaic_virus": 46,
    "tomato_septoria_leaf_spot": 47,
    "tomato_spider_mites_two_spotted_spider_mite": 48,
    "tomato_target_spot": 49,
    "tomato_yellow_leaf_curl_virus": 50,
    "tomato_yellowleaf": 51,
    "wheat_healthy": 52,
    "wheat_yellow_rust": 53
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "qkv_bias": true,
  "transformers_version": "5.4.0"
}
